Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA90_DFP/1.0.18/CA90/atdf/PIC32CZ8110CA90176.atdf
        <module name="TPI" id="SYSTEM_IP" version="1.0.0">
          <instance name="TPI">
            <register-group name="TPI" name-in-module="TPI" address-space="base" offset="0xE0040000"/>
          </instance>
        </module>
        <module name="TRAM" id="03938" name2="drm_tram_u2801_v2" version="2a0">
          <instance name="TRAM">
            <register-group name="TRAM" name-in-module="TRAM" address-space="base" offset="0x44824000"/>
            <parameters>
              <param name="ADDR_MSB" value="10" caption="Value of the MSB bit of physical RAM address"/>
              <param name="INSTANCE_ID" value="17" caption="Instance index for TRAM"/>
              <param name="MCLK_ID_APB" value="21" caption="Index for TRAM APB clock"/>
              <param name="PAC_ID" value="17" caption="Index for TRAM registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="TRNG" id="03597" name2="math_trng_u2242_v1" version="1d0">
          <instance name="TRNG">
            <register-group name="TRNG" name-in-module="TRNG" address-space="base" offset="0x44870000"/>
            <parameters>
              <param name="INSTANCE_ID" value="59" caption="Instance index for TRNG"/>
              <param name="MCLK_ID_APB" value="68" caption="Index for TRNG APB clock"/>
              <param name="PAC_ID" value="59" caption="Index for TRNG registers write protection"/>
            </parameters>
          </instance>
        </module>
        <module name="USBHS" id="03787" name2="usb_otg_2_0_ctlr_v2" version="2a0">
          <instance name="USBHS0">
            <register-group name="USBHS0" name-in-module="USBHS" address-space="base" offset="0x4F010000"/>
            <signals>
              <signal group="USB0ID" function="default" pad="USBID0"/>
              <signal group="USB0PN" function="default" pad="USBDM0"/>
              <signal group="USB0PP" function="default" pad="USBDP0"/>
              <signal group="USBRBIAS" function="default" pad="USBRBIAS0"/>
              <signal group="VBUS" function="default" pad="VBUS0"/>
            </signals>
            <parameters>
              <param name="MCLK_ID_AHB" value="73" caption="Index for USBHS0 AHB clock"/>
            </parameters>
          </instance>
          <instance name="USBHS1">
            <register-group name="USBHS1" name-in-module="USBHS" address-space="base" offset="0x4F012000"/>
            <signals>
              <signal group="USB0ID" function="default" pad="USBID1"/>
              <signal group="USB0PN" function="default" pad="USBDM1"/>
              <signal group="USB0PP" function="default" pad="USBDP1"/>
              <signal group="USBRBIAS" function="default" pad="USBRBIAS1"/>
              <signal group="VBUS" function="default" pad="VBUS1"/>
            </signals>
            <parameters>
              <param name="MCLK_ID_AHB" value="74" caption="Index for USBHS1 AHB clock"/>
            </parameters>
          </instance>
        </module>
        <module name="WDT" id="03611" name2="wdt_u2251_v2" version="2b0">
          <instance name="WDT">
            <register-group name="WDT" name-in-module="WDT" address-space="base" offset="0x44070000"/>
            <parameters>
              <param name="FUSES_UPDATE_SUPPORT" value="0" caption="WDT Fuse Update Support"/>
              <param name="INSTANCE_ID" value="11" caption="Instance index for WDT"/>
              <param name="MCLK_ID_APB" value="14" caption="Index for WDT APB clock"/>
              <param name="PAC_ID" value="11" caption="Index for WDT registers write protection"/>
            </parameters>
          </instance>
        </module>
      </peripherals>
      <interrupts>
        <interrupt name="Reset" index="-15" caption="Reset Vector, invoked on Power up and warm reset"/>
        <interrupt name="NonMaskableInt" index="-14" caption="Non maskable Interrupt, cannot be stopped or preempted"/>
        <interrupt name="HardFault" index="-13" caption="Hard Fault, all classes of Fault"/>
        <interrupt name="MemoryManagement" index="-12" caption="Memory Management, MPU mismatch, including Access Violation and No Match"/>
        <interrupt name="BusFault" index="-11" caption="Bus Fault, Pre-Fetch-, Memory Access Fault, other address/memory related Fault"/>
        <interrupt name="UsageFault" index="-10" caption="Usage Fault, i.e. Undef Instruction, Illegal State Transition"/>
        <interrupt name="SVCall" index="-5" caption="System Service Call via SVC instruction"/>
        <interrupt name="DebugMonitor" index="-4" caption="Debug Monitor"/>
        <interrupt name="PendSV" index="-2" caption="Pendable request for system service"/>
        <interrupt name="SysTick" index="-1" caption="System Tick Timer"/>
        <interrupt name="FCW" index="0" module-instance="FCW" caption="Flash Write Controller Interrupt"/>
        <interrupt name="FCR_ECCERR" index="1" module-instance="FCR" caption="Flash Read Controller ECC Error"/>
        <interrupt name="FCR_CRC_FAULT" index="2" module-instance="FCR" caption="Flash Read Controller CRC Fault"/>
        <interrupt name="PM" index="3" module-instance="PM" caption="Power Manager"/>
        <interrupt name="SUPC" index="4" module-instance="SUPC" caption="Supply Controller"/>
        <interrupt name="OSCCTRL_FAIL" index="5" module-instance="OSCCTRL" caption="External Oscillator Fail"/>
        <interrupt name="OSCCTRL_XOSCRDY" index="6" module-instance="OSCCTRL" caption="External Oscillator Ready"/>
        <interrupt name="OSCCTRL_DFLLRDY" index="7" module-instance="OSCCTRL" caption="DFLL Ready"/>
        <interrupt name="OSCCTRL_OTHER" index="8" module-instance="OSCCTRL" caption="DFLL Other Interrupt"/>
        <interrupt name="OSCCTRL_LOCK" index="9" module-instance="OSCCTRL" caption="PLL Lock"/>
        <interrupt name="OSC32KCTRL_FAIL" index="10" module-instance="OSC32KCTRL" caption="32K Oscillator Fail"/>
        <interrupt name="OSC32KCTRL_RDY" index="11" module-instance="OSC32KCTRL" caption="32K Oscillator Ready"/>
        <interrupt name="MCLK" index="12" module-instance="MCLK" caption="Main Clock"/>
        <interrupt name="FREQM" index="13" module-instance="FREQM" caption="Frequency Meter"/>
        <interrupt name="WDT" index="14" module-instance="WDT" caption="Watchdog Timer"/>
        <interrupt name="RTC_TAMPER" index="15" module-instance="RTC" caption="RTC Tamper"/>
        <interrupt name="RTC_OVF" index="16" module-instance="RTC" caption="RTC Overflow"/>
        <interrupt name="RTC_PERIOD" index="17" module-instance="RTC" caption="RTC Period"/>
        <interrupt name="RTC_COMPARE" index="18" module-instance="RTC" caption="RTC Compare"/>
        <interrupt name="EIC_EXTINT_0" index="19" module-instance="EIC" caption="External Interrupt 0"/>
        <interrupt name="EIC_EXTINT_1" index="20" module-instance="EIC" caption="External Interrupt 1"/>
        <interrupt name="EIC_EXTINT_2" index="21" module-instance="EIC" caption="External Interrupt 2"/>
        <interrupt name="EIC_EXTINT_3" index="22" module-instance="EIC" caption="External Interrupt 3"/>
        <interrupt name="EIC_EXTINT_4" index="23" module-instance="EIC" caption="External Interrupt 4"/>
        <interrupt name="EIC_EXTINT_5" index="24" module-instance="EIC" caption="External Interrupt 5"/>
        <interrupt name="EIC_EXTINT_6" index="25" module-instance="EIC" caption="External Interrupt 6"/>
        <interrupt name="EIC_EXTINT_7" index="26" module-instance="EIC" caption="External Interrupt 7"/>
        <interrupt name="EIC_EXTINT_8" index="27" module-instance="EIC" caption="External Interrupt 8"/>
        <interrupt name="EIC_EXTINT_9" index="28" module-instance="EIC" caption="External Interrupt 9"/>
        <interrupt name="EIC_EXTINT_10" index="29" module-instance="EIC" caption="External Interrupt 10"/>
        <interrupt name="EIC_EXTINT_11" index="30" module-instance="EIC" caption="External Interrupt 11"/>
        <interrupt name="EIC_EXTINT_12" index="31" module-instance="EIC" caption="External Interrupt 12"/>
        <interrupt name="EIC_EXTINT_13" index="32" module-instance="EIC" caption="External Interrupt 13"/>
        <interrupt name="EIC_EXTINT_14" index="33" module-instance="EIC" caption="External Interrupt 14"/>
        <interrupt name="EIC_EXTINT_15" index="34" module-instance="EIC" caption="External Interrupt 15"/>
        <interrupt name="PAC" index="35" module-instance="PAC" caption="Peripheral Access Controller"/>
        <interrupt name="DRMTCM" index="36" module-instance="DRMTCM" caption="TCM RAM ECC Interrupt"/>
        <interrupt name="MCRAMC" index="37" module-instance="MCRAMC" caption="Multi-Channel RAM Controller"/>
        <interrupt name="TRAM" index="38" module-instance="TRAM" caption="Trust RAM Interrupt"/>
        <interrupt name="DMA_PRI3" index="39" module-instance="DMA" caption="DMA Priority 3 Interrupt"/>
        <interrupt name="DMA_PRI2" index="40" module-instance="DMA" caption="DMA Priority 2 Interrupt"/>
        <interrupt name="DMA_PRI1" index="41" module-instance="DMA" caption="DMA Priority 1 Interrupt"/>
        <interrupt name="DMA_PRI0" index="42" module-instance="DMA" caption="DMA Priority 0 Interrupt"/>
        <interrupt name="EVSYS_0" index="43" module-instance="EVSYS" caption="Event System  InterruptChannel 0"/>
        <interrupt name="EVSYS_1" index="44" module-instance="EVSYS" caption="Event System Channel 1"/>
        <interrupt name="EVSYS_2" index="45" module-instance="EVSYS" caption="Event System Channel 2"/>
        <interrupt name="EVSYS_3" index="46" module-instance="EVSYS" caption="Event System Channel 3"/>
        <interrupt name="EVSYS_4" index="47" module-instance="EVSYS" caption="Event System Channel 4"/>
        <interrupt name="EVSYS_5" index="48" module-instance="EVSYS" caption="Event System Channel 5"/>
        <interrupt name="EVSYS_6" index="49" module-instance="EVSYS" caption="Event System Channel 6"/>
        <interrupt name="EVSYS_7" index="50" module-instance="EVSYS" caption="Event System Channel 7"/>
        <interrupt name="EVSYS_8" index="51" module-instance="EVSYS" caption="Event System Channel 8"/>
        <interrupt name="EVSYS_9" index="52" module-instance="EVSYS" caption="Event System Channel 9"/>
        <interrupt name="EVSYS_10" index="53" module-instance="EVSYS" caption="Event System Channel 10"/>
        <interrupt name="EVSYS_11" index="54" module-instance="EVSYS" caption="Event System Channel 11"/>
        <interrupt name="SERCOM0_6" index="55" module-instance="SERCOM0" caption="USART/SPI/I2C Error"/>
        <interrupt name="SERCOM0_5" index="56" module-instance="SERCOM0" caption="USART Receive Break"/>
        <interrupt name="SERCOM0_0" index="57" module-instance="SERCOM0" caption="USART-SPI Data Register Empty/ I2C Stop Received"/>
        <interrupt name="SERCOM0_1" index="58" module-instance="SERCOM0" caption="USART-SPI Transmit Complete/ I2C Address Match"/>
        <interrupt name="SERCOM0_2" index="59" module-instance="SERCOM0" caption="USART-SPI Receive Complete/ I2C Data Ready"/>
        <interrupt name="SERCOM0_3" index="60" module-instance="SERCOM0" caption="USART Receive Start/ SPI Slave Select Low/ I2C TX FIFO Empty"/>
        <interrupt name="SERCOM0_4" index="61" module-instance="SERCOM0" caption="USART Clear To Send Input Change/ I2C RX FIFO Full"/>
        <interrupt name="SERCOM1_6" index="62" module-instance="SERCOM1" caption="USART/SPI/I2C Error"/>
        <interrupt name="SERCOM1_5" index="63" module-instance="SERCOM1" caption="USART Receive Break"/>
        <interrupt name="SERCOM1_0" index="64" module-instance="SERCOM1" caption="USART-SPI Data Register Empty/ I2C Stop Received"/>
        <interrupt name="SERCOM1_1" index="65" module-instance="SERCOM1" caption="USART-SPI Transmit Complete/ I2C Address Match"/>
        <interrupt name="SERCOM1_2" index="66" module-instance="SERCOM1" caption="USART-SPI Receive Complete/ I2C Data Ready"/>
        <interrupt name="SERCOM1_3" index="67" module-instance="SERCOM1" caption="USART Receive Start/ SPI Slave Select Low/ I2C TX FIFO Empty"/>
        <interrupt name="SERCOM1_4" index="68" module-instance="SERCOM1" caption="USART Clear To Send Input Change/ I2C RX FIFO Full"/>
        <interrupt name="SERCOM2_6" index="69" module-instance="SERCOM2" caption="USART/SPI/I2C Error"/>
        <interrupt name="SERCOM2_5" index="70" module-instance="SERCOM2" caption="USART Receive Break"/>
        <interrupt name="SERCOM2_0" index="71" module-instance="SERCOM2" caption="USART-SPI Data Register Empty/ I2C Stop Received"/>
        <interrupt name="SERCOM2_1" index="72" module-instance="SERCOM2" caption="USART-SPI Transmit Complete/ I2C Address Match"/>
        <interrupt name="SERCOM2_2" index="73" module-instance="SERCOM2" caption="USART-SPI Receive Complete/ I2C Data Ready"/>
        <interrupt name="SERCOM2_3" index="74" module-instance="SERCOM2" caption="USART Receive Start/ SPI Slave Select Low/ I2C TX FIFO Empty"/>
        <interrupt name="SERCOM2_4" index="75" module-instance="SERCOM2" caption="USART Clear To Send Input Change/ I2C RX FIFO Full"/>
        <interrupt name="SERCOM3_6" index="76" module-instance="SERCOM3" caption="USART/SPI/I2C Error"/>
        <interrupt name="SERCOM3_5" index="77" module-instance="SERCOM3" caption="USART Receive Break"/>
        <interrupt name="SERCOM3_0" index="78" module-instance="SERCOM3" caption="USART-SPI Data Register Empty/ I2C Stop Received"/>
        <interrupt name="SERCOM3_1" index="79" module-instance="SERCOM3" caption="USART-SPI Transmit Complete/ I2C Address Match"/>
        <interrupt name="SERCOM3_2" index="80" module-instance="SERCOM3" caption="USART-SPI Receive Complete/ I2C Data Ready"/>
        <interrupt name="SERCOM3_3" index="81" module-instance="SERCOM3" caption="USART Receive Start/ SPI Slave Select Low/ I2C TX FIFO Empty"/>
        <interrupt name="SERCOM3_4" index="82" module-instance="SERCOM3" caption="USART Clear To Send Input Change/ I2C RX FIFO Full"/>
        <interrupt name="SERCOM4_6" index="83" module-instance="SERCOM4" caption="USART/SPI/I2C Error"/>
        <interrupt name="SERCOM4_5" index="84" module-instance="SERCOM4" caption="USART Receive Break"/>
        <interrupt name="SERCOM4_0" index="85" module-instance="SERCOM4" caption="USART-SPI Data Register Empty/ I2C Stop Received"/>
        <interrupt name="SERCOM4_1" index="86" module-instance="SERCOM4" caption="USART-SPI Transmit Complete/ I2C Address Match"/>
        <interrupt name="SERCOM4_2" index="87" module-instance="SERCOM4" caption="USART-SPI Receive Complete/ I2C Data Ready"/>
        <interrupt name="SERCOM4_3" index="88" module-instance="SERCOM4" caption="USART Receive Start/ SPI Slave Select Low/ I2C TX FIFO Empty"/>
        <interrupt name="SERCOM4_4" index="89" module-instance="SERCOM4" caption="USART Clear To Send Input Change/ I2C RX FIFO Full"/>
        <interrupt name="SERCOM5_6" index="90" module-instance="SERCOM5" caption="USART/SPI/I2C Error"/>
        <interrupt name="SERCOM5_5" index="91" module-instance="SERCOM5" caption="USART Receive Break"/>
        <interrupt name="SERCOM5_0" index="92" module-instance="SERCOM5" caption="USART-SPI Data Register Empty/ I2C Stop Received"/>
        <interrupt name="SERCOM5_1" index="93" module-instance="SERCOM5" caption="USART-SPI Transmit Complete/ I2C Address Match"/>
        <interrupt name="SERCOM5_2" index="94" module-instance="SERCOM5" caption="USART-SPI Receive Complete/ I2C Data Ready"/>
        <interrupt name="SERCOM5_3" index="95" module-instance="SERCOM5" caption="USART Receive Start/ SPI Slave Select Low/ I2C TX FIFO Empty"/>
        <interrupt name="SERCOM5_4" index="96" module-instance="SERCOM5" caption="USART Clear To Send Input Change/ I2C RX FIFO Full"/>
        <interrupt name="SERCOM6_6" index="97" module-instance="SERCOM6" caption="USART/SPI/I2C Error"/>
        <interrupt name="SERCOM6_5" index="98" module-instance="SERCOM6" caption="USART Receive Break"/>
        <interrupt name="SERCOM6_0" index="99" module-instance="SERCOM6" caption="USART-SPI Data Register Empty/ I2C Stop Received"/>
        <interrupt name="SERCOM6_1" index="100" module-instance="SERCOM6" caption="USART-SPI Transmit Complete/ I2C Address Match"/>
        <interrupt name="SERCOM6_2" index="101" module-instance="SERCOM6" caption="USART-SPI Receive Complete/ I2C Data Ready"/>
        <interrupt name="SERCOM6_3" index="102" module-instance="SERCOM6" caption="USART Receive Start/ SPI Slave Select Low/ I2C TX FIFO Empty"/>
        <interrupt name="SERCOM6_4" index="103" module-instance="SERCOM6" caption="USART Clear To Send Input Change/ I2C RX FIFO Full"/>
        <interrupt name="SERCOM7_6" index="104" module-instance="SERCOM7" caption="USART/SPI/I2C Error"/>
        <interrupt name="SERCOM7_5" index="105" module-instance="SERCOM7" caption="USART Receive Break"/>
        <interrupt name="SERCOM7_0" index="106" module-instance="SERCOM7" caption="USART-SPI Data Register Empty/ I2C Stop Received"/>
        <interrupt name="SERCOM7_1" index="107" module-instance="SERCOM7" caption="USART-SPI Transmit Complete/ I2C Address Match"/>
        <interrupt name="SERCOM7_2" index="108" module-instance="SERCOM7" caption="USART-SPI Receive Complete/ I2C Data Ready"/>
        <interrupt name="SERCOM7_3" index="109" module-instance="SERCOM7" caption="USART Receive Start/ SPI Slave Select Low/ I2C TX FIFO Empty"/>
        <interrupt name="SERCOM7_4" index="110" module-instance="SERCOM7" caption="USART Clear To Send Input Change/ I2C RX FIFO Full"/>
        <interrupt name="TCC0_OTHER" index="125" module-instance="TCC0" caption="Error/Overflow/Underflow/Fault Interrupt"/>
        <interrupt name="TCC0_CNT_TRIG" index="126" module-instance="TCC0" caption="Counter/Re-Trigger Interrupt"/>
        <interrupt name="TCC0_MC0" index="127" module-instance="TCC0" caption="TCC Match/Compare 0"/>
        <interrupt name="TCC0_MC1" index="128" module-instance="TCC0" caption="TCC Match/Compare 1"/>
        <interrupt name="TCC0_MC2" index="129" module-instance="TCC0" caption="TCC Match/Compare 2"/>
        <interrupt name="TCC0_MC3" index="130" module-instance="TCC0" caption="TCC Match/Compare 3"/>
        <interrupt name="TCC0_MC4" index="131" module-instance="TCC0" caption="TCC Match/Compare 4"/>
        <interrupt name="TCC0_MC5" index="132" module-instance="TCC0" caption="TCC Match/Compare 5"/>
        <interrupt name="TCC0_MC6" index="133" module-instance="TCC0" caption="TCC Match/Compare 6"/>
        <interrupt name="TCC0_MC7" index="134" module-instance="TCC0" caption="TCC Match/Compare 7"/>
        <interrupt name="TCC1_OTHER" index="135" module-instance="TCC1" caption="Error/Overflow/Underflow/Fault Interrupt"/>
        <interrupt name="TCC1_CNT_TRIG" index="136" module-instance="TCC1" caption="Counter/Re-Trigger Interrupt"/>
        <interrupt name="TCC1_MC0" index="137" module-instance="TCC1" caption="TCC Match/Compare 0"/>
        <interrupt name="TCC1_MC1" index="138" module-instance="TCC1" caption="TCC Match/Compare 1"/>
        <interrupt name="TCC1_MC2" index="139" module-instance="TCC1" caption="TCC Match/Compare 2"/>
        <interrupt name="TCC1_MC3" index="140" module-instance="TCC1" caption="TCC Match/Compare 3"/>
        <interrupt name="TCC1_MC4" index="141" module-instance="TCC1" caption="TCC Match/Compare 4"/>
        <interrupt name="TCC1_MC5" index="142" module-instance="TCC1" caption="TCC Match/Compare 5"/>
        <interrupt name="TCC1_MC6" index="143" module-instance="TCC1" caption="TCC Match/Compare 6"/>
        <interrupt name="TCC1_MC7" index="144" module-instance="TCC1" caption="TCC Match/Compare 7"/>
        <interrupt name="TCC2_OTHER" index="145" module-instance="TCC2" caption="Error/Overflow/Underflow/Fault Interrupt"/>
        <interrupt name="TCC2_CNT_TRIG" index="146" module-instance="TCC2" caption="Counter/Re-Trigger Interrupt"/>
        <interrupt name="TCC2_MC0" index="147" module-instance="TCC2" caption="TCC Match/Compare 0"/>
        <interrupt name="TCC2_MC1" index="148" module-instance="TCC2" caption="TCC Match/Compare 1"/>
        <interrupt name="TCC2_MC2" index="149" module-instance="TCC2" caption="TCC Match/Compare 2"/>
        <interrupt name="TCC2_MC3" index="150" module-instance="TCC2" caption="TCC Match/Compare 3"/>
        <interrupt name="TCC2_MC4" index="151" module-instance="TCC2" caption="TCC Match/Compare 4"/>
        <interrupt name="TCC2_MC5" index="152" module-instance="TCC2" caption="TCC Match/Compare 5"/>
        <interrupt name="TCC3_OTHER" index="153" module-instance="TCC3" caption="Error/Overflow/Underflow/Fault Interrupt"/>
        <interrupt name="TCC3_CNT_TRIG" index="154" module-instance="TCC3" caption="Counter/Re-Trigger Interrupt"/>
        <interrupt name="TCC3_MC0" index="155" module-instance="TCC3" caption="TCC Match/Compare 0"/>
        <interrupt name="TCC3_MC1" index="156" module-instance="TCC3" caption="TCC Match/Compare 1"/>
        <interrupt name="TCC4_OTHER" index="157" module-instance="TCC4" caption="Error/Overflow/Underflow/Fault Interrupt"/>
        <interrupt name="TCC4_CNT_TRIG" index="158" module-instance="TCC4" caption="Counter/Re-Trigger Interrupt"/>
        <interrupt name="TCC4_MC0" index="159" module-instance="TCC4" caption="TCC Match/Compare 0"/>
        <interrupt name="TCC4_MC1" index="160" module-instance="TCC4" caption="TCC Match/Compare 1"/>
        <interrupt name="TCC5_OTHER" index="161" module-instance="TCC5" caption="Error/Overflow/Underflow/Fault Interrupt"/>
        <interrupt name="TCC5_CNT_TRIG" index="162" module-instance="TCC5" caption="Counter/Re-Trigger Interrupt"/>
        <interrupt name="TCC5_MC0" index="163" module-instance="TCC5" caption="TCC Match/Compare 0"/>
        <interrupt name="TCC5_MC1" index="164" module-instance="TCC5" caption="TCC Match/Compare 1"/>
        <interrupt name="TCC6_OTHER" index="165" module-instance="TCC6" caption="Error/Overflow/Underflow/Fault Interrupt"/>
        <interrupt name="TCC6_CNT_TRIG" index="166" module-instance="TCC6" caption="Counter/Re-Trigger Interrupt"/>
        <interrupt name="TCC6_MC0" index="167" module-instance="TCC6" caption="TCC Match/Compare 0"/>
        <interrupt name="TCC6_MC1" index="168" module-instance="TCC6" caption="TCC Match/Compare 1"/>
        <interrupt name="TCC7_OTHER" index="169" module-instance="TCC7" caption="Error/Overflow/Underflow/Fault Interrupt"/>
        <interrupt name="TCC7_CNT_TRIG" index="170" module-instance="TCC7" caption="Counter/Re-Trigger Interrupt"/>
        <interrupt name="TCC7_MC0" index="171" module-instance="TCC7" caption="TCC Match/Compare 0"/>
        <interrupt name="TCC7_MC1" index="172" module-instance="TCC7" caption="TCC Match/Compare 1"/>
        <interrupt name="TCC8_OTHER" index="173" module-instance="TCC8" caption="Error/Overflow/Underflow/Fault Interrupt"/>
        <interrupt name="TCC8_CNT_TRIG" index="174" module-instance="TCC8" caption="Counter/Re-Trigger Interrupt"/>
        <interrupt name="TCC8_MC0" index="175" module-instance="TCC8" caption="TCC Match/Compare 0"/>
        <interrupt name="TCC8_MC1" index="176" module-instance="TCC8" caption="TCC Match/Compare 1"/>
        <interrupt name="TCC9_OTHER" index="177" module-instance="TCC9" caption="Error/Overflow/Underflow/Fault Interrupt"/>
        <interrupt name="TCC9_CNT_TRIG" index="178" module-instance="TCC9" caption="Counter/Re-Trigger Interrupt"/>
        <interrupt name="TCC9_MC0" index="179" module-instance="TCC9" caption="TCC Match/Compare 0"/>
        <interrupt name="TCC9_MC1" index="180" module-instance="TCC9" caption="TCC Match/Compare 1"/>
        <interrupt name="TCC9_MC2" index="181" module-instance="TCC9" caption="TCC Match/Compare 2"/>
        <interrupt name="TCC9_MC3" index="182" module-instance="TCC9" caption="TCC Match/Compare 3"/>
        <interrupt name="TCC9_MC4" index="183" module-instance="TCC9" caption="TCC Match/Compare 4"/>
