Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CZ-CA90_DFP/1.0.18/CA90/atdf/PIC32CZ8110CA90176.atdf
        <register name="DID" offset="0x120" rw="R" size="4" initval="0x0920F053" caption="Device Identification">
          <bitfield name="MARKER" caption="Marker Bit" mask="0x1"/>
          <bitfield name="MANID" caption="Manufacturer ID" mask="0xFFE"/>
          <bitfield name="DEVSEL" caption="Device Select" mask="0xFF000"/>
          <bitfield name="PRODUCT" caption="Product" mask="0xFF00000"/>
          <bitfield name="REVISION" caption="Revision" mask="0xF0000000"/>
        </register>
        <register name="DAL" offset="0x124" rw="R" size="4" initval="0x00000000" caption="Debugger Access Level">
          <bitfield name="CPU0" caption="Per CPU Debugger Access Level" mask="0x3" values="DAL__CPU"/>
          <bitfield name="CPU1" caption="Per CPU Debugger Access Level" mask="0xC" values="DAL__CPU"/>
          <bitfield name="CPU2" caption="Per CPU Debugger Access Level" mask="0x30" values="DAL__CPU"/>
          <bitfield name="CPU3" caption="Per CPU Debugger Access Level" mask="0xC0" values="DAL__CPU"/>
        </register>
        <register name="ENTRY" offset="0x1000" rw="R" size="4" count="8" initval="0x00000000" caption="Coresight ROM Table Entry x">
          <bitfield name="EPRES" caption="Entry Present" mask="0x1"/>
          <bitfield name="FMT" caption="Format" mask="0x2"/>
          <bitfield name="ADDOFF" caption="Address Offset" mask="0xFFFFF000"/>
        </register>
        <register name="MEMTYPE" offset="0x1FCC" rw="R" size="4" initval="0x00000000" caption="Coresight ROM Table Memory Type">
          <bitfield name="SMEMP" caption="System Memory Present" mask="0x1"/>
        </register>
        <register name="PID4" offset="0x1FD0" rw="R" size="4" initval="0x00000000" caption="Coresight ROM Table Peripheral Identification 4">
          <bitfield name="JEPCC" caption="JEP-106 Continuation Code" mask="0xF"/>
          <bitfield name="FKBC" caption="4KB count" mask="0xF0"/>
        </register>
        <register name="PID5" offset="0x1FD4" rw="R" size="4" initval="0x00000000" caption="Coresight ROM Table Peripheral Identification 5">
        </register>
        <register name="PID6" offset="0x1FD8" rw="R" size="4" initval="0x00000000" caption="Coresight ROM Table Peripheral Identification 6">
        </register>
        <register name="PID7" offset="0x1FDC" rw="R" size="4" initval="0x00000000" caption="Coresight ROM Table Peripheral Identification 7">
        </register>
        <register name="PID0" offset="0x1FE0" rw="R" size="4" initval="0x000000D0" caption="Coresight ROM Table Peripheral Identification 0">
          <bitfield name="PARTNBL" caption="Part Number Low" mask="0xFF"/>
        </register>
        <register name="PID1" offset="0x1FE4" rw="R" size="4" initval="0x0000009C" caption="Coresight ROM Table Peripheral Identification 1">
          <bitfield name="PARTNBH" caption="Part Number High" mask="0xF"/>
          <bitfield name="JEPIDCL" caption="Low part of the JEP-106 Identity Code" mask="0xF0"/>
        </register>
        <register name="PID2" offset="0x1FE8" rw="R" size="4" initval="0x0000002A" caption="Coresight ROM Table Peripheral Identification 2">
          <bitfield name="JEPIDCH" caption="JEP-106 Identity Code High" mask="0x7"/>
          <bitfield name="JEPU" caption="JEP-106 Identity Code is used" mask="0x8"/>
          <bitfield name="REVISION" caption="Revision Number" mask="0xF0"/>
        </register>
        <register name="PID3" offset="0x1FEC" rw="R" size="4" initval="0x00000000" caption="Coresight ROM Table Peripheral Identification 3">
          <bitfield name="CUSMOD" caption="ARM CUSMOD" mask="0xF"/>
          <bitfield name="REVAND" caption="Revision Number" mask="0xF0"/>
        </register>
        <register name="CID0" offset="0x1FF0" rw="R" size="4" initval="0x0000000D" caption="Coresight ROM Table Component Identification 0">
          <bitfield name="PREAMBLEB0" caption="Preamble Byte 0" mask="0xFF"/>
        </register>
        <register name="CID1" offset="0x1FF4" rw="R" size="4" initval="0x00000010" caption="Coresight ROM Table Component Identification 1">
          <bitfield name="PREAMBLE" caption="Preamble" mask="0xF"/>
          <bitfield name="CCLASS" caption="Component Class" mask="0xF0"/>
        </register>
        <register name="CID2" offset="0x1FF8" rw="R" size="4" initval="0x00000005" caption="Coresight ROM Table Component Identification 2">
          <bitfield name="PREAMBLEB2" caption="Preamble Byte 2" mask="0xFF"/>
        </register>
        <register name="CID3" offset="0x1FFC" rw="R" size="4" initval="0x000000B1" caption="Coresight ROM Table Component Identification 3">
          <bitfield name="PREAMBLEB3" caption="Preamble Byte 3" mask="0xFF"/>
        </register>
      </register-group>
      <value-group name="CTRL__CMD">
        <value name="NOOP" caption="No operation" value="0x0"/>
        <value name="CRC32" caption="32-bit Cyclic Redundancy Code" value="0xA500"/>
        <value name="MBIST" caption="Global Memory built-in self-test" value="0xA501"/>
      </value-group>
      <value-group name="ADDR__AMOD">
        <value name="EXIT_ON_ERROR" caption="STATUSA.FAIL rises upon first error and algorithm stops (STATUSA.DONE rises)." value="0x0"/>
        <value name="PAUSE_ON_ERROR" caption="STATUSA.FAIL rises when an error is detected and algorith stops until STATUSA.FAIL is cleared. Once cleared, the algorithm is resumed going to next test step." value="0x1"/>
      </value-group>
      <value-group name="DATA__STATE">
        <value name="SET1" caption="SET1 Phase: read '0' write '1'" value="0x9"/>
        <value name="SET2" caption="SET2 Phase: read '1' write '0'" value="0xA"/>
        <value name="SET2B" caption="SET2B Phase: read '0' write '1'" value="0xB"/>
        <value name="CLEAR1" caption="CLEAR1 Phase: read '1' write '0'" value="0xC"/>
        <value name="CLEAR2" caption="CLEAR2 Phase: read '0' write '1'" value="0xD"/>
        <value name="CLEAR2B" caption="CLEAR2B Phase: read '1' write '0'" value="0xE"/>
        <value name="READ" caption="READ Phase: check memory is cleared" value="0xF"/>
      </value-group>
      <value-group name="CFG__DCCDMALEVEL">
        <value name="EMPTY" caption="Trigger x rises when DCC is read and falls when it is written" value="0"/>
        <value name="FULL" caption="Trigger x rises when DCC is written and falls when it is read" value="1"/>
      </value-group>
      <value-group name="MBFI0__AMMOD">
        <value name="ADDR" caption="Address match, fault injected when the masked master address matches with the masked bcc1.addr" value="0x0"/>
        <value name="ALWAYS" caption="Always matches, fault injected every AHB access" value="0x1"/>
      </value-group>
      <value-group name="MBFI0__FTYPE">
        <value name="STUCKAT0" caption="Stuck At 0" value="0x0"/>
        <value name="STUCKAT1" caption="Stuck At 1" value="0x1"/>
      </value-group>
